"""
2. Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать
защищенными. Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного
полотна. Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра
дороги асфальтом, толщиной в 1 см * число см толщины полотна. Проверить работу метода.

Например: 20м * 5000м * 25кг * 5см = 12500 т
"""

class Road:

    def __init__(self, length, width):
        self.length = length
        self.width = width

    def MassCount(self):
        self.weigth = 0.025  # 25кг
        self.thickness = 0.05  # 5см
        print(f'Масса дорожного покрытия составит:'
              f' {self.length * self.width * self.weigth * self.thickness} тон')

road_to_village = Road(5000, 20)
road_to_village.MassCount()

print('\nКонец программы')